Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/fkvideo_deploy.po
Languages: ru

source: Configure and Start Video Face Detection
ru: Настройка и запуск видеодетектора

source: This section will guide you through the :program:`fkvideo_detector` deployment process. Follow the steps below minding the sequence.
ru: Для развертывания обнаружения лиц на видео выполните по порядку приведенные ниже инструкции.

source: The fkvideo_detector component has to be :ref:`installed <fkvideo-install>`.
ru: Компонент ``fkvideo_detector`` должен быть :ref:`установлен <fkvideo-install>`.

source: In this section:
ru: В этом разделе:

source: Specify Video Streams
ru: Задание видеопотоков

source: To specify video streams for face detection, do the following:
ru: Для того чтобы задать видеопотоки для обработки, выполните следующие действия:

source: Make a copy of the configuration file ``/etc/fkvideo.ini``. Open the new file for editing.
ru: Скопируйте файл конфигурации ``/etc/fkvideo.ini``. Откройте копию для редактирования.

source: If you have only one camera, you can add it in the new configuration file.
ru: Если у вас только одна видеокамера, вы можете добавить ее через файл конфигурации.

source: You can find an example of the configuration file `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/fk_local_config.ini>`__.
ru: Пример файла конфигурации см. `здесь <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/fk_local_config.ini>`__.

source: If you have more than one camera, use the Server to store all your cameras. Add your camera to server by POST request v1/camera. For example, add camera to detector=detec1:
ru: Если у вас несколько видеокамер, храните список видеокамер на Сервере FindFace. Для этого добавьте каждую видеокамеру с помощью запроса ``POST v1/camera`` в виртуальный детектор, соответствующий определенному списку камер. Например, для того чтобы добавить видеокамеру в детектор ``detec1``, выполните следующие действия:

source: Request
ru: Запрос

source: Response
ru: Ответ

source: Now edit your configuration file. For example, detector will connect to server, and get all cameras with detector=detec1
ru: Теперь отредактируйте файл конфигурации. Запущенный с приведенным ниже файлом конфигурации видеодетектор лиц подключится к Серверу и запросит список камер из виртуального детектора ``detec1``.

source: You can find an example of the configuration file `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/fk_server_config.ini>`__.
ru: Пример файла конфигурации см. `здесь <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/fk_server_config.ini>`__.

source: Start Component as Application
ru: Запуск компонента как приложения

source: To start fkvideo_detector as an application, execute:
ru: Вы можете запустить видеодетектор лиц как приложение, используя следующую команду:

source: Use this method for testing purposes.
ru: Используйте данный метод для тестирования компонента.

source: Start Component as Service
ru: Запуск компонента как сервиса

source: To run the face detection component as a service, do the following:
ru: Для запуска видеодетектора лиц как сервиса выполните следующие действия:

source: Execute the following command:
ru: Выполните команду:

source: Check service status. The command will return a service description, a status should be active (running).
ru: Убедитесь, что сервис активен. Команда вернет описание сервиса, его статус (должен быть Активен), путь и длительность текущей сессии.

source: You can get the list of your cameras by the following request:
ru: Вы можете отобразить список всех камер, отправив запрос:
