Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/methods.po
Languages: ru

source: General Methods
ru: Общие методы

source: In this section:
ru: В этом разделе:

source: Method /detect POST
ru: Метод /detect POST

source: This method detects faces in the provided image and recognize gender, age, and emotions, given the request parameters. You can either upload the image as multipart/form-data or provide the image URL.
ru: Данный метод служит для обнаружения лица на изображении. Вы можете задать изображение в виде файла с составным содержимым (multipart/form-data) или предоставить ссылку на изображение в сети Интернет.

source: Parameters:
ru: Параметры:

source: ``photo``: an uploaded image, or a publicly accessible URL, containing the image
ru: ``photo``: загруженная фотография или публичный URL фотографии.

source: ``gender``: if true, return gender
ru: ``gender``: если true, возвращает информацию о поле

source: ``age``: if true, return age
ru: ``age``: если true, возвращает информацию о возрасте

source: ``emotions``: if true, return emotions
ru: ``emotions``: если true, возвращает инфомацию об эмоциях

source: Returns:
ru: Возвращает:

source: A list of rectangles, containing the detected faces
ru: Список координат рамок вокруг обнаруженных лиц.

source: Example
ru: Пример

source: Request
ru: Запрос

source: Response
ru: Ответ

source: Method /verify POST
ru: Метод /verify POST

source: This method is used to verify that two faces belong to the same person, or, alternatively, measures the similarity between the two faces. You can choose between these two modes by setting the ``threshold`` parameter.
ru: Данный метод сравнивает две фотографии, проверяя, принадлежит ли изображенное на них лицо одному и тому же человеку, и возвращает степень схожести двух лиц. Дополнительно степень схожести может сравниваться с заданным пороговым значением для принятия однозначного решения о совпадении лиц.

source: In the case, when a binary decision is required, the user should pass a value for the ``threshold`` parameter. You can use one of the 3 :ref:`preset values <thresholds>`: ``strict``, ``medium`` and ``low`` with the former aimed at minimizing the false accept rates and the latter being somewhat more permissive. You can also set a user-defined value.
ru: В случае если требуется однозначное решение о совпадении лиц, на Сервер необходимо передать ненулевое значение параметра ``threshold``. Вы можете использовать одно из 3-х :ref:`предустановленных значений <thresholds>`: ``strict``, ``medium`` или ``low``. Вы также можете задать собственное пороговое значение.

source: In the case, when you need to calculate similarity of different persons or find similar people rather than verify identity, pass ``none`` to the ``threshold`` parameter.
ru: В случае если нужно просто вычислить степень схожести 2-х лиц, а не верифицировать идентичность, передайте параметр ``threshold`` со значением ``none``.

source: If no threshold level is specified, it is set to the default value ``0.75``.
ru: Если параметр ``threshold`` не передан, его значение по умолчанию устанавливается равным ``0.75``.

source: Please feel free to contact us if you need to tune the threshold value for your specific use-case and/or dataset.
ru: При необходимости свяжитесь с нашими специалистами для подбора оптимального порогового значения для вашей системы.

source: ``photo1``: the first uploaded image or an external URL
ru: ``photo1``: первая загруженная фотография или публичный URL фотографии.

source: ``photo2``: the second uploaded image or an external URL
ru: ``photo2``: вторая загруженная фотография или публичный URL фотографии.

source: ``bbox1`` [optional]: array of bounding boxes for the faces on the first photo
ru: ``bbox1`` [опционально]: массив рамок с лицами на первом фото, которые нужно сравнить.

source: ``bbox2`` [optional]: array of bounding boxes for the faces on the second photo
ru: ``bbox2`` [опционально]: массив рамок с лицами на втором фото, которые нужно сравнить.

source: ``threshold`` [optional]: one of "strict", "medium", "low" or "none", or a value between 0 and 1. Default is 0.75.
ru: ``threshold`` [опционально]: пороговая степень схожести лиц для принятия положительного решения о совпадении. Задайте значение от 0 до 1 или используйте предустановленный порог: "strict" (высокий), "medium" (средний), "low" (низкий, установлен по умолчанию), "none" (не задан). По умолчанию сравнение выполняется при 0.75.

source: ``mf_selector`` [optional]: specifies behavior in a case of multiple faces on a photo; one of:
ru: ``mf_selector`` [опционально]: задает поведение Сервера при наличии нескольких лиц на фотографии. Возможные значения ``mf_selector``:

source: ``"reject"``: return an error if more than one face was detected on any of image
ru: ``"reject"``: возвращает ошибку, если хотя бы на одной из фотографий присутствует более одного лица.

source: ``"biggest"`` [default]: add the biggest face on the image
ru: ``"biggest"`` [по умолчанию]: проверяет самое большое лицо на фотографии.

source: ``"all"``: verify all faces, found on both images.
ru: ``"all"``: проверяет схожесть всех лиц, обнаруженных на обеих фотографиях.

source: Note that providing ``bbox1`` or ``bbox2`` argument overrides the value of this parameter.
ru: Параметры ``bbox1`` и ``bbox2`` отменяют значение этого параметра.

source: binary verification result, only returned if threshold was not set to none. Each pair of faces is given it's own result. The given pair of photos is also provided with the verification result. It will be true if each face on the first photo has a match on the second.
ru: Результат верификации: совпадает или не совпадает. Результат возвращается, если задано пороговое значение верификации. При наличии нескольких лиц на фотографиях результат указывается как для каждой пары лиц, так и на уровне фотографий. На уровне фотографий результат верификации будет положительным, если каждая пара лиц на них совпадает.

source: the coordinates of the bounding boxes with the faces on the images
ru: Координаты рамок с лицами на фотографиях.

source: the algorithm's confidence in the decision, measured from 0 to 1
ru: Вероятность совпадения (степень схожести) лиц от 0 до 1.

source: Method /identify POST
ru: Метод /identify POST

source: This method is used to search through the face database. The method returns at most n faces (one by default), which are the most similar to the specified face, and the similarity is above the specified :ref:`threshold <thresholds>`. You can optionally specify a gallery id to check a photo only against photos in this gallery.
ru: Данный метод используется для поиска лица в базе биометрических данных и возвращает выборку лиц, если степень их схожести с искомым выше определенного :ref:`порогового значения <thresholds>`.

source: ``photo``: the uploaded image, or an external URL
ru: ``photo``: загруженная фотография или публичный URL фотографии.

source: ``x1, y1, x2, y2`` [optional]: coordinates of a bounding box of the face on the photo
ru: ``x1, y1, x2, y2`` [опционально]: координаты прямоугольника на фотографии, внутри которого находится искомое лицо(а).

source: ``n`` [optional]: maximum number of closest faces to return, 1 by default
ru: ``n`` [опционально]: максимальное число лиц в выборке, одно по умолчанию.

source: ``strict`` [optional]: specifies behavior in case if one or several tntapi shards are out of service. This parameter takes priority over the ``tntapi_ignore_search_errors`` parameter from the findface-facenapi :ref:`configuration file <configure-network>`.
ru: ``strict`` [опционально]: задает поведение Сервера на случай, если один или несколько шардов ``tntapi`` недоступны. Данный параметр имеет приоритет над параметром ``tntapi_ignore_search_errors`` в :ref:`файле конфигурации <configure-network>` ``findface-facenapi``.

source: ``True``: return an error if some tntapi shards are out of service
ru: ``True``: возвращает ошибку, если некоторые шарды ``tntapi`` недоступны.

source: ``False`` [default]: use available tntapi shards to obtain face identification results, indicating the number of available servers vs the total number of servers in the ``X-Live-Servers`` header.
ru: ``False`` [по умолчанию]: Сервер использует доступные шарды ``tntapi`` для получения результатов идентификации лица и указывает в ответе отношение количества доступных шардов ``tntapi`` к их общему количеству в заголовке ``X-Live-Servers``.

source: ``mf_selector`` [optional]: specifies behavior in case if multiple faces are detected on the photo or inside the provided bounding box:
ru: ``mf_selector`` [optional]: задает поведение Сервера при наличии нескольких лиц на фотографии или внутри заданного прямоугольника. Возможные значения:

source: ``"biggest"`` [default]: identify the biggest face on the image
ru: ``"biggest"`` [по умолчанию]: поиск по базе данных выполняется для самого крупного лица на фотографии.

source: ``"all"``: identify all faces, found on the image.
ru: ``"all"``: поиск по базе данных выполняется по всем лицам на фотографии.

source: A map where keys are array representations of bounding boxes of faces on provided photo and values are arrays face objects, along with match confidence, measured from 0 (lowest) to 1 (highest)
ru: Координаты рамок с лицами, найденными на фотографии. Для каждого набора координат возвращается массив схожих лиц из базы биометрических данных вместе с вероятностью совпадения от 0 до 1.

source: Method /face POST
ru: Метод /face POST

source: Processes the uploaded image or provided URL, detects faces and adds the detected faces to the searchable database. If there are multiple faces on the photos, only the biggest face is added by default. You can add a custom string meta, such as name or ID, which uniquely identifies a person. Multiple face objects may have the same meta. We recommend that you don't assign the same meta to different persons. Thus when using person's name as a meta, make sure that all names are unique. You can optionally prefix it with a gallery id to upload into non-default gallery.
ru: Данный метод обрабатывает загруженное изображение или изображение в сети Интернет, обнаруживает на нем лица и добавляет их вместе с векторами признаков в базу биометрических данных. Если на изображении несколько лиц, то по умолчанию в базу данных добавляется только самое крупное. Вместе с лицом вы также можете добавить метаданные, которые являются уникальными для его обладателя, например, идентификатор или имя. Не рекомендуется назначать одинаковые метаданные разным людям. При необходимости вы можете указать имя галереи, в которую нужно добавить лицо помимо галереи по умолчанию.

source: ``meta`` [optional]: some user-defined string identifier
ru: ``meta`` [опционально]: пользовательские метаданные.

source: ``bbox`` [optional]: array of bounding boxes specifying face locations on the image
ru: ``bbox`` [опционально]: массив рамок, содержащих лица на изображении.

source: ``mf_selector`` [optional]: specifies behavior in case if there are multiple faces found on the image or inside the specified rectangle; one of:
ru: ``mf_selector`` [опционально]: задает поведение Сервера при наличии нескольких лиц на фотографии или внутри заданного прямоугольника. Возможные значения:

source: ``"reject"``: return an error if more than one face was detected
ru: ``"reject"``: возвращает ошибку, если хотя бы на одной из фотографий присутствует более одного лица.

source: ``"all"``: add all faces, found on the image. Please note that the meta will be the same for all faces added
ru: ``"all"``: добавляет все лица, обнаруженные на фотографии. Имейте в виду, что в этом случае метаданные будут одинаковыми для всех лиц.

source: ``galleries`` [optional]: list of gallery names
ru: ``galleries`` [опционально]: список имен галерей, в которые необходимо добавить лицо.

source: ``cam_id`` [optional]: UUID of the camera
ru: ``cam_id`` [опционально]: UUID видеокамеры, от которой пришло изображение лица.

source: A JSON representation of the added faces or a failure reason
ru: Представление данных добавленного лица в JSON или ошибку при добавлении.

source: In the case multiple faces are detected and ``mf_selector`` is set to reject, this method returns ``400 Bad Request`` and a list of bounding box coordinates for each detected face.
ru: В случае если на изображении было обнаружено несколько лиц и значение ``mf_selector="reject"``, метод возвращает код ошибки ``400`` (``Bad Request``), а также список координат рамок для каждого обнаруженного лица.

source: Example #1
ru: Пример №1

source: Example #2
ru: Пример №2

source: Method /face/id/<id> GET
ru: Метод /face/id/<id> GET

source: Returns detailed information about the face with id = FaceID.
ru: Данный метод возвращает подробную информацию о лице с заданным id.

source: This method doesn't accept any additional parameters.
ru: Отсутствуют.

source: A JSON representation of the face with ``id = FaceID``.
ru: Представление данных лица с определенным id в JSON.

source: Method /face/id/<id> PUT
ru: Метод /face/id/<id> PUT

source: This method can be used to modify certain fields of the face object with ``id = FaceID``. Currently only changes to the meta attribute are supported.
ru: Данный метод используется для изменения значений полей объекта ``лицо`` с заданным id.

source: ``meta``: new meta string
ru: ``meta``: новые метаданные.

source: ``person_id``: unique identifier of the person
ru: ``person_id``: уникальный идентификатор персоны в базе данных.

source: ``galleries``: JSON dictionary with one key and one value. Either \ ``{"add":["list","of","galleries"]}``, \ ``{"del":["list","of","galleries"]}``, \ ``{"set":["list","of","galleries"]}``. Allows you to add face to galleries, remove from galleries or replace gallery list completely.
ru: ``galleries``: словарь JSON с одной парой ключ-значение. Вы можете добавить, удалить или полностью изменить список пользовательских галерей, в которых хранится лицо: ``{"add":["list","of","galleries"]}, {"del":["list","of","galleries"]}, {"set":["list","of","galleries"]}``.

source: A JSON representation of the updated face with id = FaceID
ru: Представление обновленных данных лица в JSON.

source: Method /face/id/<id> DELETE
ru: Метод /face/id/<id> DELETE

source: Deletes a face with the id = FaceId.
ru: Данный метод удаляет лицо с заданным id.

source: This method does not accept any additional parameters.
ru: Отсутствуют.

source: HTTP 204 No Content in the case of success, or the reason of failure
ru: HTTP 204 No Content в случае успеха или причину ошибки.

source: Method /face/meta/<meta> GET
ru: Метод /face/meta/<meta> GET

source: Returns the list of faces with a given meta string. Note that the method is case-sensitive, so the given meta has to fully match the one from the database. A meta string has to be URL encoded, and according to the standard, spaces should be encoded as **%20** (not +) in this part of the URL.
ru: Возвращает список лиц с заданными метаданными. Имейте в виду, что данный метод чувствителен к регистру. Строка с метаданными должна быть в кодировке URL. Пробелы между словами в метаданных должны быть закодированы как ``%20``.

source: Returns the list of faces with a <meta>.
ru: Возвращает список лиц с заданными метаданными.

source: Method /faces GET
ru: Метод /faces GET

source: Parameters
ru: Параметры:

source: Returns the list of all faces stored in database.
ru: Данный метод возвращает список всех лиц в базе биометрических данных.

source: Method /faces/gallery/<gallery> GET
ru: Метод /faces/gallery/<gallery> GET

source: Returns the list of all faces stored in a specified gallery.
ru: Возвращает список всех лиц в базе данных.

source: Method /meta GET
ru: Метод /meta GET

source: This method retrieves all the meta string stored in the database along with one of the associated faces. To get more faces call ``GET /v0/face/meta/[Meta]``.
ru: Данный метод возвращает все уникальные строки с метаданными, хранящимися в базе данных. Для каждой строки возвращается одно из связанных с ней лиц. Для того чтобы получить все лица, связанные с той или иной строкой, используйте метод ``GET /v0/face/meta/<meta>``.

source: This method doesn't accept any additional parameters
ru: Отсутствуют.

source: A list of objects containing meta string, number of faces marked with this meta string, and JSON representation of the first face object marked with this meta string
ru: Список объектов, содержащих уникальные строки с метаданными, количество лиц, связанных с той или иной строкой, JSON-представление данных первого лица, связанного со строкой.

source: Method /galleries GET
ru: Метод /galleries GET

source: List all your galleries.
ru: Данный метод возвращает список всех существующих галерей в базе данных.

source: A JSON dictionary with list of gallery ids
ru: Словарь JSON со списком имен (id) галерей.

source: Method /galleries/<gallery> POST
ru: Метод /galleries/<gallery> POST

source: Creates a new gallery under a given name. The gallery name can contain English letters, numbers, underscore and minus sign (``[a-zA-Z0-9_-]+``). It shouldn't be longer than 48 characters.
ru: Данный метод создает новую галерею с заданным именем. Имя галереи может содержать латинские буквы, числа, знак подчеркивания и минус ([a-zA-Z0-9_-]+) и не может быть длиннее 48 символов.

source: Method /galleries/<gallery> DELETE
ru: Метод /galleries/<gallery> DELETE

source: Deletes the gallery and all faces in it.
ru: Данный метод удаляет галерею и все лица в ней.

source: Method /docs GET
ru: Метод /docs GET

source: Lists documented API versions. Available without authorization.
ru: Данный метод возвращает список всех задокументированных версий API. Доступен без авторизации.

source: Method /docs/<version> GET
ru: Метод /docs/<version> GET

source: Get documentation for specified API version. Available without authorization.
ru: Данный метод возвращает документацию к заданной версии API. Доступен без авторизации.

source: Method /person/id/<id> GET
ru: Метод /person/id/<id> GET

source: A JSON representation of the person with id = FaceID
ru: Представление данных человека с заданным ``person_id`` в JSON.

source: Method /history/search POST
ru: Метод /history/search POST

source: This method retrieves all events from camera history of the given parameters.
ru: Данный метод возвращает все события по видеокамере(ам), удовлетворяющие заданным условиям.

source: ``"person_id"`` [optional]: unique person id
ru: ``"person_id"`` [опционально]: значение параметра ``person_id`` интересующего человека.

source: ``"cam_ids"`` [optional]: array of camera ids.
ru: ``"cam_id"`` [опционально]: массив id видеокамер.

source: ``"start"`` [optional]: search history interval, start time as ISO8601 string
ru: ``"start"`` [опционально]: время начала событий в формате ISO8601.

source: ``"end"`` [option]: search history interval, end time as ISO8601 string
ru: ``"end"`` [опционально]: время конца событий в формате ISO8601.

source: ``"friend"`` [optional]: friend or foe identification
ru: ``"friend"`` [опционально]: является ли человек «своим».

source: ``"limit"`` [optional]: records per page, if 0 (default) - unlimited
ru: ``"limit"`` [опционально]: количество записей на странице, по умолчанию 0 — не ограничено.

source: A list of history events.
ru: Список всех событий истории.

source: ``next_page``: URL to the next page (path and query portion only). If no such field in response - no more pages exist.
ru: ``next_page``: URL к следующей странице результатов поиска (содержит путь и указатель на следующую порцию результатов). Если такого поля нет в ответе, значит, была выведена последняя страница.
