Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/ntls_status.po
Languages: ru

source: Retrieve Licensing Information
ru: Получение информации о лицензии

source: You can use API to retrieve :ref:`licensing <licensing>` information in JSON.
ru: Вы можете использовать API для получения информации о :ref:`лицензии <licensing>` в формате JSON.

source: Request
ru: Запрос

source: Exemplary response
ru: Пример ответа

source: The ``last_updated`` parameter in the response indicates how long ago the local license has been checked for the last time. Interpret its value (in seconds) as follows:
ru: Параметр ``last_updated`` в ответе показывает, как давно в последний раз проверялась локальная лицензия. Интерпретируйте его значение (в секундах) следующим образом:

source: [0, 5] — everything is alright.
ru: [0, 5] — все работает отлично.

source: (5, 30] — there may be some problems with connection, or with a local drive where the license file is stored.
ru: (5, 30] — возможно имеют место быть какие-то проблемы со связью, либо с локальным накопителем, где хранятся файлы лицензий.

source: (30; 120] — almost certainly something bad happened.
ru: (30; 120] — почти наверняка случилось что-то нехорошее.

source: (120; ∞) — the licensing source response has been timed out. Take action.
ru: (120; ∞) — не удается получить ответ от источника лицензирования в течение длительного времени. Необходимо вмешательство.

source: ``"valid": false``: connection with the licensing source has never been established.
ru: ``"valid": false``: связь с источником лицензирования так и не была установлена.
