Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/persons.po
Languages: ru

source: Dynamic Person Creation
ru: Группировка лиц персоны в базе данных

source: You can tailor FindFace Enterprise Server SDK to work in video surveillance and video analytics systems. To do so, harness the Dynamic Person Creation feature.
ru: Вы можете интегрировать FindFace Enterprise Server SDK в системы видеонаблюдения и видеоаналитики. Для этого задействуйте функцию группировки лиц, принадлежащих одному человеку (персоне).

source: In this section:
ru: В этом разделе:

source: How it works
ru: Принцип работы

source: |persons_en|
ru: |persons_ru|

source: An image containing a face (for example, extracted from a RTSP video stream by the video face detector) is sent via a ``/face POST`` request to FindFace Server for identification.
ru: Содержащее лицо изображение (например, захваченное в кадре видеодетектором лиц) отправляется на Сервер FindFace для идентификации через запрос ``/face POST``.

source: When identifying a person, the system uses a face property ``person_id``. For each person in the database, the value of this property should be unique.
ru: При идентификации персоны Сервер использует свойство лица ``person_id``. Для каждой персоны в базе данных значение данного свойства должно быть уникально.

source: FindFace Server takes the new face and searches for the most similar one in the database (the so-called reference face). If similarity between the faces is equal or exceeds the threshold specified in the ``findface-facenapi.ini`` configuration file (``person_identify_threshold``), the new face is added to the database and assigned the same ``person_id`` value as the reference face. It also inherits some other reference face properties. This means that the new face has been identified as belonging to an existing person.
ru: Сервер FindFace получает новое лицо и находит наиболее похожее на него в базе данных (так называемое опорное лицо). В случае если схожесть лиц равна или превышает порог, указанный в файле конфигурации ``findface-facenapi.ini`` (``person_identify_threshold``), новое лицо добавляется в базу данных с присвоением того же значения параметра ``person_id``, что и у опорного лица. Оно также наследует некоторые другие свойства опорного лица (например, метаданные). Это означает, что новое лицо было распознано как принадлежащее существующей персоне.

source: If similarity between the faces does not exceed the given threshold, the system considers the new face as unidentified. In this case, the new face is added to the database as belonging to a new person, with a new ``person_id``.
ru: Если схожесть между лицами не превышает заданного порогового значения, Сервер рассматривает новое лицо как нераспознанное. В этом случае новое лицо добавляется в базу данных как принадлежащее новой персоне, с новым значением ``person_id``.

source: In either case, FindFace Server returns a response containing the ``person_id`` value assigned to the added face. This value can be then used in analysis.
ru: В обоих случаях Сервер возвращает ответ, содержащий значение ``person_id``, присвоенное добавленному лицу. Данное значение может быть далее использовано в аналитике.

source: On account of the very logic of dynamic person creation, resembling faces of different people can be identified as belonging to one person and get the same ``person_id``. To avoid this situation, we recommend you to periodically inspect the person database and manually resolve each identity conflict.
ru: Похожие лица, принадлежащие разным людям, могут быть распознаны как лица одной персоны и получить одинаковые значения параметра ``person_id``. Для того чтобы избежать подобной ситуации, рекомендуется периодически просматривать базу данных, вручную разрешая каждый конфликт идентичности.

source: Configure Dynamic Person Creation
ru: Включение группировки лиц

source: By default, dynamic person creation is disabled. This means that all newly added faces are not assigned the person_id property and the system does not discern persons.
ru: По умолчанию лица персоны не группируются. Это означает, что всем вновь добавленным лицам не назначается свойство ``person_id``, а разные люди Сервером не различаются.

source: To enable dynamic person creation, do the following:
ru: Для того чтобы включить группировку лиц персоны, выполните следующие действия:

source: Open the ``findface-facenapi.ini`` configuration file for editing.
ru: Откройте для редактирования файл конфигурации ``findface-facenapi.ini``.

source: Edit the settings.
ru: Отредактируйте настройки.

source: The ``findface-facenapi.ini`` content must be correct Python code.
ru: Содержимое файла ``findface-facenapi.ini`` должно представлять собой синтаксически верный код Python.

source: Uncomment and edit the line ``person_identify = False``. This will enable dynamic person creation.
ru: Раскомментируйте и отредактируйте строку ``person_identify = False``, чтобы включить группировку лиц.

source: By default, dynamic person creation is performed independently for each camera. To merge person identification results across all cameras, uncomment and edit the line ``person_identify_global = False``. This option works well only in small-scale systems with less than 5 cameras. Otherwise, leave it deactivated.
ru: По умолчанию группировка лиц выполняется отдельно по каждой видеокамере. Для слияния результатов группировки по всем видеокамерам раскомментируйте и отредактируйте строку ``person_identify_global = False``. Данную опцию можно использовать в небольших системах до 5 камер. Если камер больше, оставьте опцию выключенной.

source: Uncomment and set the threshold for person identification between 0 and 1.
ru: Раскомментируйте строку и установите порог для идентификации персоны от 0 до 1.

source: Restart the service.
ru: Перезапустите сервис ``findface-facenapi``.

source: REST API Sequence for Person Dataset Analysis
ru: Последовательность REST API для анализа данных персоны

source: There are many ways to harness the dynamic person creation feature in analytics. A typical REST API sequence to identify a person and then work with their data is the following:
ru: Существует множество способов задействовать группировку лиц персон в аналитике. Типичная последовательность REST API для идентификации персоны и последующей работы с ее данными представлена ниже:

source: Method
ru: Метод

source: Description
ru: Описание

source: Add a face to the database and receive a JSON representation of it, including the person\_id value.
ru: Добавьте лицо в базу данных и получите информацию о добавленном лице в формате JSON, в том числе значение параметра ``person_id``.

source: Retrieve all events from the history of cameras, related to the person whose person\_id was received in the /face POST response.
ru: Найдите все события по видеокамерам, связанные с персоной, чей ``person_id`` вы получили в ответе на запрос ``/face POST``.

source: Method /face POST
ru: Метод /face POST

source: Request
ru: Запрос

source: Response
ru: Ответ

source: Method /history/search POST
ru: Метод /history/search POST

source: Other API Methods to Work with Persons
ru: Другие методы API для работы с персоной в базе данных

source: Add and change ``person_id``
ru: Добавление и изменение ``person_id``

source: To add or change the ``person_id`` value for a particular face, use the method ``PUT /face/id/<face_id>``.
ru: Для добавления или изменения значения параметра ``person_id`` определенного лица используйте метод ``PUT /face/id/<face_id>``.

source: Since the ``person_id`` property is assigned only to newly added faces, old faces in the database are excluded from the person identification process. Use the method ``PUT /face/id/<face_id>`` to solve the problem.
ru: Поскольку свойство ``person_id`` назначается только вновь добавляемым лицам, прежние лица в базе данных не участвуют в идентификации персоны. Используйте метод ``PUT /face/id/<face_id>`` для решения данной проблемы.

source: Retrieve person history
ru: Поиск событий, связанных с персоной

source: To retrieve all events from the history of cameras, related to the person with a given ``person_id``, you can use the method ``GET /person/history/id/<person_id>`` (equally with ``/history/search POST``).
ru: Для поиска в истории видеокамер всех событий, связанных с персоной с заданным ``person_id``, используйте метод ``GET /person/history/id/<person_id>`` (наравне с методом ``/history/search POST``).

source: List persons
ru: Получение списка персон

source: To get the list of all existing persons, use the method ``GET /persons``.
ru: Для получения списка всех существующих персон в базе данных, используйте метод ``GET /persons``.
