Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/regenerate_facens.po
Languages: ru

source: Migrate to Different Detector or Model
ru: Миграция на другой детектор или модель

source: Do not hesitate to contact our experts on migration by info@ntechlab.com.
ru: Не стесняйтесь обращаться к нашим специалистам по вопросам миграции по адресу info@ntechlab.com.

source: Sometimes you have to migrate your FindFace Enterprise Server SDK instance to another face detector or neural network model. This usually happens when you decide to update to the latest version of the product.
ru: Иногда вам может потребоваться миграция экземпляра FindFace Enterprise Server SDK на другой детектор лиц или модель нейронной сети. Как правило, данная процедура необходима при обновлении до последней версии продукта.

source: You can find the models summary :ref:`here <models>`.
ru: Сводные сведения по моделям см. :ref:`здесь <models>`.

source: If you need to re-detect faces, you must regenerate both normalized face images, thumbnails and facens. If you just want to apply a different model, it usually suffices to regenerate only facens. FindFace Enterprise Server SDK provides tools that can handle most migration use cases.
ru: При смене детектора лиц вам следует повторно сгенерировать нормализованные изображения и миниатюры лиц, а также векторы признаков.

source: Different detectors have diverse sensitivity to certain facial features. Be aware that, after re-detecting your database, you may miss out on some previously found faces.
ru: Различные детекторы лиц обладают разной чувствительностью к чертам лица. Имейте в виду, что новый детектор может пропустить ранее найденные лица.

source: In this section:
ru: В этом разделе:

source: Tools
ru: Утилиты

source: To migrate your instance, you will need the following tools:
ru: Для миграции экземпляра FindFace Enterprise Server SDK вам потребуются следующие утилиты:

source: Tool
ru: Утилита

source: Description
ru: Описание

source: Script that regenerates and overrides face data in MongoDB by applying different detector settings or another model to the images in the ``Uploads`` folder.
ru: Скрипт, который повторно генерирует и перезаписывает данные лиц в MongoDB, применяя новые настройки детектора или модель нейронной сети к изображениям в папке ``Uploads``.

source: Script that copies newly generated facens from MongoDB to Tarantool.
ru: Скрипт, который копирует перегенерированные векторы признаков из MongoDB в Tarantool.

source: Both tools are automatically installed with :ref:`findface-facenapi <install-facenapi>`.
ru: Обе утилиты автоматически устанавливаются вместе с компонентом :ref:`findface-facenapi <install-facenapi>`.

source: Requirements
ru: Требования

source: The ``/var/lib/ffupload/uploads/`` folder (``Uploads``) has to be populated with at least the original images. Its content can be viewed at ``http://<findface_upload_IP:3333/uploads/`` in your browser.
ru: Папка ``/var/lib/ffupload/uploads/`` (``Uploads``) должна быть заполнена как минимум исходными изображениями. Ее содержимое можно просмотреть в браузере по адресу ``http://<findface_upload_IP:3333/uploads/``.

source: Overall, the ``findface-regenerate`` tool works with the ``Uploads`` folder in the following way:
ru: В общем случае утилита ``findface-regenerate`` работает с папкой ``Uploads`` следующим образом:

source: Use case
ru: Случай использования

source: How it works
ru: Принцип работы

source: Different detector settings
ru: Смена настроек детектора

source: The ``findface-regenerate`` tool runs original images through the ``facenapi``-``nnapi`` pipeline with different detector [and model] settings, and returns regenerated normalized images, thumbnails and facens.
ru: Утилита ``findface-regenerate`` прогоняет исходные изображения через компоненты ``facenapi`` и ``nnapi`` с новыми настройками детектора [и модели] и возвращает перегенерированные нормализованные изображения лиц, миниатюры лиц и векторы признаков.

source: Different model
ru: Смена модели

source: The ``findface-regenerate`` tool runs normalized face images through ``nnapi`` with different model settings, and returns regenerated facens.
ru: Утилита ``findface-regenerate`` прогоняет нормализованные изображения лиц через компонент ``nnapi`` с новыми настройками модели и возвращает перегенерированные векторы признаков.

source: Regenerate Face Data
ru: Повторная генерация артефактов

source: Before conducting any operations on your MongoDB database, be sure to create its backup.
ru: Перед проведением любых операций с базой данных MongoDB обязательно создайте резервную копию.

source: Apply ``findface-regenerate`` as follows:
ru: Примените утилиту ``findface-regenerate`` следующим образом:

source: Navigate into ``/usr/bin/``. Display and thoroughly examine the ``findface-regenerate`` help message:
ru: Перейдите в папку ``/usr/bin/``. Отобразите и внимательно изучите справку по утилите ``findface-regenerate``:

source: To change detector settings, uncomment and edit the detector-related parameters in the ``findface-facenapi`` configuration file.
ru: Для смены настроек детектора раскомментируйте и отредактируйте относящиеся к детектору параметры в файле конфигурации ``findface-facenapi``.

source: To switch the face biometric :ref:`model <models>`, edit the ``model_facen`` parameter in the ``findface-nnapi`` configuration file:
ru: Для смены :ref:`биометрической модели <models>` лица, отредактируйте параметр ``model_facen`` в файле конфигурации ``findface-nnapi``:

source: Configure ``findface-regenerate`` by using command line arguments as described in the help message. For example, to switch the face detector, execute from ``/usr/bin``:
ru: Настройте ``findface-regenerate``, используя аргументы командной строки, как описано в справке по утилите. Например, для того чтобы сменить детектор лиц, выполните из папки ``/usr/bin`` следующую команду:

source: To switch the model, execute::
ru: Для смены модели выполните команду::

source: Copy Facens from MongoDB to Tarantool
ru: Копирование векторов признаков из MongoDB в Tarantool

source: Apply ``mongo2searchapi`` as follows:
ru: Примените утилиту ``mongo2searchapi`` следующим образом:

source: Create a backup for Tarantool.
ru: Создайте резервную копию БД Tarantool.

source: Stop Tarantool.
ru: Остановите Tarantool.

source: Delete snapshot ``.snap``, xlog ``.xlog`` and :ref:`fast index <fast-index>` ``.idx`` files for all tntapi shards.
ru: Удалите файлы снапшотов ``.snap``, логов ``.xlog`` и :ref:`быстрого индеса <fast-index>` ``.idx`` для всех шардов ``tntapi``.

source: By default, these files are stored in the following folders:
ru: По умолчанию, данные файлы хранятся в следующих папках:

source: Standalone instance:
ru: Одиночная инсталляция:

source: Cluster instance:
ru: Кластерная инсталляция:

source: If facens :ref:`differ in size <models>` for the old and new models, update the facen size in the ``FindFace.start`` section of the Tarantool configuration file :samp:`/etc/tarantool/instances.enabled/FindFace_{shard_N}.lua`. Do so for each shard.
ru: Если векторы признаков в прежней и новой модели :ref:`различаются по размеру <models>`, отредактируйте размер вектора признаков в разделе ``FindFace.start`` файла конфигурации Tarantool :samp:`/etc/tarantool/instances.enabled/FindFace_{shard_N}.lua`. Повторите для каждого шарда.

source: Run ``mongo2searchapi`` on the ``findface-facenapi`` host:
ru: Запустите ``mongo2searchapi`` на сервере с ``findface-facenapi``:

source: Start Tarantool
ru: Запустите Tarantool.
