Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/system_requirements.po
Languages: ru

source: System Requirements
ru: Системные требования

source: In this chapter:
ru: В этой главе:

source: General Requirements
ru: Общие требования

source: Hosts
ru: Базовый сервер(ы)

source: Prior to installing FindFace Enterprise Server SDK, ensure that the host(s) meet the following minimum requirements:
ru: Перед развертыванием Сервера FindFace убедитесь, что физические серверы, на которых будут установлены его компоненты, удовлетворяют следующим минимальным требованиям:

source: :ref:`Standalone installation <standalone>` of FindFace Enterprise Server SDK is recommended when the number of faces in the database **does not** exceed some ``1,000,000``. Otherwise you should install Findface Enterprise Server SDK in a :ref:`cluster environment <cluster>` and configure :ref:`fast index <fast-index>` search.
ru: FindFace Enterprise Server SDK может быть развернут на :ref:`одиночном физическом сервере <standalone>`, если количество лиц в базе данных ориентировочно не превышает ``1 000 000``. Иначе FindFace Enterprise Server SDK должен быть развернут в :ref:`кластерном окружении <cluster>` с настройкой :ref:`быстрого поиска <fast-index>` по индексу.

source: Requirement
ru: Требование

source: Description
ru: Описание

source: CPU
ru: Процессор

source: x86-64 CPU (Intel), >2.0 Ghz, >2 cores. The CPU AVX support is required for operation of all the components, except findface-upload.
ru: x86-64 CPU (Intel), >2.0 ГГц, >2 ядер. Для работы всех компонентов Сервера FindFace, кроме ``findface-upload``, необходимо, чтобы процессор поддерживал расширение набора инструкций AVX.

source: RAM
ru: Оперативная память

source: RAM consumption depends on the number of faces in your dataset. Use the benchmark results :ref:`below <RAM-benchmark>` to calculate the memory size you need. Note that if there are 2 or more galleries with facens, you have to multiply the given MongoDB and Tarantool RAM consumption by the relevant number of galleries. As a rule, ``10,000,000`` faces require 20Gb RAM for Tarantool. MongoDB does not need much RAM as it uses HDD as RAM when needed.
ru: Потребление RAM зависит от количества лиц в базе данных. Используйте результаты эталонного теста, приведенные :ref:`ниже <RAM-benchmark>`, для определения необходимого вам объема памяти. Имейте в виду, что если векторы признаков (биометрические образцы) хранятся в 2-х и более галереях, вам потребуется умножить приведенное потребление памяти базами данных MongoDB и Tarantool на соответствующее количество галерей. Как правило, для хранения ``10 000 000`` лиц Tarantool необходимо 20 ГБ RAM. MongoDB не требует большого объема памяти, поскольку при необходимости задействует в качестве RAM пространство жесткого диска.

source: HDD
ru: Жесткий диск

source: ``10,000,000`` faces require ~20x[number of snapshots for each shard] GB for Tarantool (by default 20x3=60 GB) and 24 GB for MongoDB. To store all uploaded images via findface-upload: size of all uploaded images + 10%
ru: Хранение ``10 000 000`` лиц в MongoDB требует 24 ГБ, в Tarantool ~20x[кол-во снапшотов для каждого шарда] ГБ (по умолчанию, 20x3=60 ГБ).Для хранения всех загруженных изображений с помощью компонента ``findface-upload``: суммарный размер всех загруженных изображений + 10%.

source: Operating system
ru: Операционная система

source: Ubuntu 16.04 LTS (only x64)
ru: Ubuntu 16.04 LTS (только 64-битная версия).

source: Virtual machine support
ru: Поддержка виртуальных машин

source: Here you can see the FindFace Enterprise Server SDK memory usage benchmark results. Use these data to calculate the RAM size you need.
ru: Ниже приведены результаты эталонного теста использования памяти компонентами FindFace Enterprise Server SDK. Используйте эти данные для вычисления нужного вам объема RAM.

source: Memory usage may slightly vary from test to test.
ru: Использование памяти может незначительно флуктуировать от теста к тесту.

source: Depending on your needs, :ref:`adjust <tntapi>` the Tarantool maximum memory usage at ``/etc/tarantool/instances.enabled/FindFace.lua``.
ru: В зависимости от своих нужд :ref:`скорректируйте <tntapi>` максимальное потребление памяти базой данных Tarantool в файле ``/etc/tarantool/instances.enabled/FindFace.lua``.

source: The testing setup is the following:
ru: Эталонный тест выполнен со следующими настройками:

source: Facen :ref:`model <models>`: ``apricot_320``
ru: :ref:`Модель <models>` биометрического образца: ``apricot_320``.

source: Models for :ref:`gender, age and emotions recognition <gae>` (GAE in the table): ``fr_1_gender0``, ``fr_1_age0``, ``emotion_1``
ru: Модели для :ref:`распознавания пола, возраста и эмоций <gae>` (GAE в таблице): ``fr_1_gender0``, ``fr_1_age0``, ``emotion_1``.

source: Models used in :ref:`extraction-api <extraction-api>`: ``apricot_320``, ``fr_1_gender0``, ``fr_1_age0``, ``emotion_1``
ru: Модели, использованные в компоненте :ref:`extraction-api <extraction-api>`: ``apricot_320``, ``fr_1_gender0``, ``fr_1_age0``, ``emotion_1``.

source: ``MongoDB``, ``Tarantool``: facens are stored in one gallery. If there are 2 or more galleries with facens, multiply the given RAM amount by the relevant number of galleries.
ru: MongoDB, Tarantool: для хранения биометрических образцов используется только 1 галерея. Если в вашем случае таких галерей несколько, умножьте приведенное потребление RAM на соответствующее количество галерей.

source: Number of faces
ru: Количество лиц

source: RAM consumption by components, MB
ru: Потребление RAM по компонентам, MБ

source: 0 (own needs)
ru: 0 (собственные нужды)

source: ~1GB (1 Core)/~7GB (8 Cores) (up to 10,5 under load)
ru: ~1ГБ (1 ядро)/~7ГБ (8 ядер) (до 10,5 под нагрузкой)

source: Supported Images
ru: Форматы изображений

source: FindFace Enterprise Server SDK supports the following image formats:
ru: FindFace Enterprise Server SDK поддерживает следующие форматы изображений:

source: The maximum image size is 10 MB. The minimum distance between pupils is 40 px.
ru: Максимальный размер изображения 10 МБ. Минимальное расстояние между зрачками 40 пикселей.

source: Video Face Detection
ru: Работа с видео

source: Video Face Detector Host
ru: Сервер под видеодетектор

source: A host for the :ref:`video face detection <video>` component must meet the following requirements (given that a video stream is 1 x 720p (1280×720) at 25FPS playback speed):
ru: Сервер, на котором установлен компонент :ref:`видеодетектор лиц <video>`, должен отвечать следующим требованиям (считая, что видеопоток 1 x 720p (1280×720) 25 FPS):

source: Requirements depend on motion activity and the number of faces in video, the video face detector settings and FindFace Enterprise Server SDK overall load. To select an optimal configuration, contact our experts by info@ntechlab.com.
ru: Требования в общем случае определяются интенсивностью движения и количеством лиц в кадре, настройками компонента, а также общей нагрузкой Сервера анализа и распознавания биометрических данных. Для выбора оптимальной конфигурации свяжитесь с нашими специалистами по адресу info@ntechlab.com.

source: ≥ INTEL Core i5 6400 (2 physical core CPU). AVX support required.
ru: ≥ INTEL Core i5 6400 (CPU с 2-мя физическими ядрами). Необходима поддержка AVX.

source: 4 GB in the real-time mode.
ru: 4 ГБ в режиме реального времени.

source: Ubuntu 16.04 LTS (only x64).
ru: Ubuntu 16.04 LTS (только 64-битная версия).

source: Supported Video File Formats and Codecs
ru: Форматы видеофайлов и кодеков

source: The fkvideo_detector component supports all video file formats and codecs that can be decoded by `FFmpeg <https://www.ffmpeg.org/general.html#Supported-File-Formats_002c-Codecs-or-Features>`__.
ru: Компонент ``fkvideo_detector`` поддерживает все форматы видеофайлов и кодеков, которые могут быть декодированы `FFmpeg <https://www.ffmpeg.org/general.html#Supported-File-Formats_002c-Codecs-or-Features>`__.

source: FindFace Web User Interface
ru: Поддержка веб-интерфейса

source: To process video in the FindFace Enterprise Server SDK :ref:`web user interface <ffui>`, its host should meet the same requirements as for the :ref:`video face detector <video-requirements>`.
ru: Для обработки видео в :ref:`веб-интерфейсе FindFace <ffui>` физический сервер должен отвечать :ref:`требованиям к видеодетектору лиц <video-requirements>`.
