Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/tarantool_api.po
Languages: ru

source: Direct API Requests to Tarantool
ru: Прямые API-запросы к базе данных Tarantool

source: You can use HTTP API to extract data directly from the Tarantool Database.
ru: Вы можете использовать HTTP API для извлечения напрямую данных из базы данных Tarantool.

source: In this section:
ru: В этом разделе:

source: General Information
ru: Общие сведения

source: API requests to Tarantool should be sent to ``http://<tarantool_host_ip:port>``.
ru: API-запросы к базе данных Tarantool следует отправлять по адресу ``http://<tarantool_host_ip:port>``.

source: The port for API requests can be found in the ``FindFace.start`` section of the Tarantool configuration file:
ru: Порт для API-запросов можно узнать в разделе ``FindFace.start`` файла конфигурации Tarantool:

source: In the case of standalone deployment, you can access Tarantool by default only locally (127.0.0.1). If you want to access Tarantool remotely, :ref:`change <tntapi-standalone>` the Tarantool configuration file.
ru: В случае если FindFace Enterprise Server SDK развернут на одиночном физическом сервере, база данных Tarantool по умолчанию будет доступна только локально (``127.0.0.1``). Если необходимо открыть доступ к базе данных Tarantool с удаленного сервера, :ref:`внесите изменения <tntapi-standalone>` в файл конфигурации ``tntapi`` во время установки компонента.

source: Each API request to Tarantool contains the following parameters:
ru: Каждый API-запрос к Tarantool содержит следующие параметры:

source: ``:ver``: the API version (v1 at the moment).
ru: ``:ver``: версия API (v1 на данный момент).

source: ``:name``: the gallery name.
ru: ``:name``: имя галереи.

source: ``:id``: the face id.
ru: ``:id``: id лица.

source: Add Face
ru: Добавление лица

source: Request
ru: Запрос

source: ``Body``: a raw feature vector (facen)
ru: ``Body``: необработанный вектор признаков (facen).

source: Returns:
ru: Возвращает:

source: HTTP 200 and empty body if success.
ru: HTTP 200 и пустое тело в случае успеха.

source: HTTP 409 if a face with the same id already exists in the gallery.
ru: HTTP 409, если лицо с таким id уже есть в галерее.

source: HTTP with a status other than 200 and error description in the body if failure.
ru: HTTP с отличным от 200 статусом и описание ошибки в случае неудачи.

source: Example
ru: Пример

source: Get Facen
ru: Получение вектора признаков

source: A JSON representation of the face with its id and base64 encoded facen if success.
ru: Представление лица в формате JSON, содержащее его id и вектор признаков в формате base64 в случае успеха.

source: HTTP 404 if a face with the given id is not found in the gallery.
ru: HTTP 404, если лицо с заданным id не найдено в галерее.

source: To convert a facen from base64 to a binary file, execute:
ru: Для преобразования вектора признаков из формата ``base64`` в бинарный файл используйте команду:

source: Remove Face
ru: Удаление лица

source: Removing a face from Tarantool will not remove it from MongoDB.
ru: Удаление лица из Tarantool не удалит его из MongoDB.

source: Face Search
ru: Поиск лица

source: ``:limit``: the maximum number of faces in the response.
ru: ``:limit``: максимальное количество лиц в ответе.

source: ``:threshold``: the minimum similarity for faces in the response (from 0 to 1).
ru: ``:threshold``: минимальная степень схожести лиц в ответе (от 0 до 1).

source: ``linear_search`` (boolean, optional): set ``linear_search=1`` (true) to use only the linear space to search for faces. This setting has priority over the ``only_index`` setting (``/etc/tarantool/instances.enabled/FindFace.lua``).
ru: ``linear_search`` (опционально): установите ``linear_search=1`` (true), чтобы при поиске лиц использовать только пространство ``linear``. Данная настройка имеет приоритет над настройкой ``only_index`` (``/etc/tarantool/instances.enabled/FindFace.lua``).

source: ``body``: a raw facen.
ru: ``body``: необработанный вектор признаков.

source: A JSON array with faces with the ``conf`` and ``id`` fields in the body if success. The value in the ``X-search-stat`` header indicates whether the fast index was used for the search: ``with_index`` or ``without_index``.
ru: Массив JSON с лицами, содержащий поля ``conf`` и ``id`` в теле в случае успеха. Значение в заголовке ``X-search-stat`` показывает, был ли использован быстрый индекс для поиска: ``with_index`` или ``without_index``.

source: List Faces
ru: Получение списка лиц

source: ``:start_id``: the minimum ``face_id`` in the response.
ru: ``:start_id``: минимальное значение id лица в ответе.

source: ``:count``: the maximum number of faces in the response.
ru: ``:count``: максимальное количество лиц в ответе.

source: A JSON array with faces, and the next page URL if success. Each face is provided with its id, base64 encoded facen and the name of a Tarantool space where the face is located (linear, preindex, or indexed). The next page URL should be passed as ``:start_id`` in another API request to get the next page of results.
ru: Массив JSON с лицами и URL следующей страницы результатов в случае успеха. Для каждого лица указывается его ``id``, вектор признаков в формате ``base64`` и имя пространства Tarantool, в котором хранится лицо (``linear``, ``preindex``, или ``indexed``). URL следующей страницы должен быть передан в другом запросе как параметр ``:start_id`` для получения следующей страницы результатов.
