Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/tntapi_additional.po
Languages: ru

source: Hacks for ``tntapi``
ru: Дополнительные возможности ``tntapi``

source: In this section:
ru: В этом разделе:

source: Additional Configuration Parameters
ru: Дополнительные параметры конфигурации

source: To configure interaction between findface-facenapi and Tarantool, specify additional parameters in the 3rd argument of the ``FindFace.start`` section in the tntapi configuration file:
ru: Для того чтобы настроить взаимодействие между компонентом ``findface-facenapi`` и Tarantool, укажите дополнительные параметры в 3-м аргументе раздела ``FindFace.start`` в файле конфигурации ``tntapi``:

source: Additional parameters:
ru: Дополнительные параметры:

source: Parameter
ru: Параметры:

source: Default value
ru: Значение по умолчанию

source: Description
ru: Описание

source: Enable request logging (/var/log/tarantool/FindFace.log).
ru: Включает запись запросов в лог (``/var/log/tarantool/FindFace.log``).

source: Facen's size. Before editing this parameter, be sure to consult NTechLab experts.
ru: Размер вектора признаков (facen). Перед тем как редактировать этот параметр, обязательно проконсультируйтесь с нашими специалистами.

source: Number of threads for fast index search.
ru: Количество тредов, используемых для поиска по быстрому индексу.

source: Only for a replica. Master instance IP address.
ru: Только для реплики базы данных Tarantool. IP-адрес ведущего сервера (мастера).

source: Enable the soft deletion mode, when the faces are not removed from the fast index, but hidden in search results.
ru: Включает режим «мягкого удаления», при котором лица не удаляются из быстрого индекса, а скрываются в результатах поиска.

source: Soft Deletion Mode
ru: Режим «мягкого удаления»

source: Tarantool supports the soft deletion mode, when the faces are not removed from the fast index, but hidden in search results. We recommend you to enable this mode due to the following benefits:
ru: Tarantool поддерживает так называемый режим «мягкого удаления», при котором лица физически не удаляются из быстрого индекса, а скрываются в результатах поиска. Данный режим рекомендуется активировать в связи со следующими преимуществами:

source: Tarantool starting time linearly depends on the number of faces removed from the ``Indexed`` space (fast index). If the soft deletion mode is on, the faces are not physically removed from the fast index, so face deletion doesn't affect the starting time.
ru: Время запуска Tarantool линейно зависит от количества лиц, удаленных из пространства ``Indexed`` (т. е. из быстрого индекса). Если режим «мягкого удаления» включен, лица физически не удаляются из быстрого индекса. Таким образом, удаление лиц не влияет на время запуска Tarantool.

source: Fast index search quality also depends on the number of physically removed faces. It doesn't sink in the soft deletion mode.
ru: Качество поиска по быстрому индексу также зависит от количества физически удаленных лиц. Оно не снижается в режиме «мягкого удаления».

source: To enable the soft deletion mode, edit the FindFace.start section as follows:
ru: Для активации режима «мягкого удаления» отредактируйте раздел ``FindFace.start`` следующим образом:

source: Tarantool Replication
ru: Репликация базы данных Tarantool

source: Replication allows multiple Tarantool instances to work on copies of the same face database. The database copies are kept in sync because each instance can communicate its changes to all the other instances. Tarantool supports master-slave replication. You can add and delete data only by using the master instance, slave instances (aka replicas) are read-only, i.e. can be used only for searching and consulting data.
ru: Репликация позволяет множественным экземплярам Tarantool работать с копиями одной и той же базы данных. Копии базы данных синхронизируются, так как каждый экземпляр Tarantool может передавать изменения в остальные. Tarantool поддерживает репликацию master-slave (ведущий-ведомые). Вы можете добавлять или удалять данные только через ведущий экземпляр (мастер). Ведомые экземпляры (реплики) могут быть использованы только для поиска и просмотра данных.

source: To learn how to deploy a Tarantool replica set, refer to the Tarantool `official documentation <https://tarantool.org/en/doc/1.7/singlehtml.html#document-doc/1.7/book/replication/index>`__.
ru: Для того чтобы развернуть набор реплик Tarantool, обратитесь к `официальной документации <https://tarantool.org/en/doc/1.7/singlehtml.html#document-doc/1.7/book/replication/index>`__ Tarantool.

source: To start a created replica for the first time, do the following:
ru: Для первого запуска созданной реплики выполните следующие действия:

source: Start the master instance.
ru: Запустите мастер.

source: In the replica configuration file, specify the IP address and listening port of the master instance.
ru: В файле конфигурации реплики укажите IP-адрес и слушающий порт мастера.

source: Copy the latest snapshot (.snap) of the master instance into the ``memtx_dir`` directory of the replica.
ru: Скопируйте последний снимок (snapshot) мастера (``*.snap``) в папку, указанную в параметре ``memtx_dir`` реплики.

source: Copy the master instance logs into the ``wal_dir`` directory of the replica.
ru: Скопируйте логи мастера в папку, указанную в параметре ``wal_dir`` реплики.

source: Start the replica. You can start as many replicas affiliated with the same master instance as needed.
ru: Запустите реплику. Вы можете запустить любое количество реплик под одним мастером.

source: Before enabling the :ref:`fast index <fast-index>` for the master instance ``:use_index("/path/to/<index>.idx")``, copy the index file (``<index>.idx``) to the same path on its replica. Then perform ``use_index`` on the master instance.
ru: Перед включением :ref:`быстрого индекса <fast-index>` на мастере (``:use_index("/путь/к/<index>.idx")``) скопируйте файл индекса (``<index>.idx``) на реплику по тому же пути. Затем выполните ``use_index`` на мастере.

source: Delete obsolete index files on the replica in order to avoid unnecessary index transitions, should the master instance and replica be heavily out of sync.
ru: Рекомендуется удалять все файлы индекса на реплике, кроме последнего, во избежание промежуточных обновлений индекса в случае сильного отставания реплики от мастера.

source: To synchronize the master instance and replica, you can also copy the latest master snapshot to the replica.
ru: Для того чтобы ускорить синхронизацию мастера и реплики, вы также можете скопировать последний снимок (snapshot) мастера в реплику.
