Repository: NTech-Lab/docs
Catalog: docs/locales/*/LC_MESSAGES/tntapi.po
Languages: ru

source: Install tntapi
ru: Установка ``tntapi``

source: The tntapi component connects the Tarantool database and the facenapi component, transferring search results from the database to facenapi for further processing. To increase search speed, multiple tntapi shards can be created on each Tarantool host. Their running concurrently leads to a remarkable increase in performance. Each shard can handle up to approximately 10,000,000 faces. In the case of standalone deployment, you need only one shard (created by default), while in a cluster environment the number of shards has to be calculated depending on several parameters (see below).
ru: Компонент ``tntapi`` соединяет базу данных Tarantool и компонент ``findface-facenapi``, передавая результаты поиска от базы данных в ``findface-facenapi`` для дальнейшей обработки. Для увеличения скорости поиска на каждом сервере с базой данных ``Tarantool`` могут быть созданы многочисленные сегменты (шарды) ``tntapi``. Их параллельное функционирование приводит к значительному увеличению производительности. Каждый шард может обрабатывать приблизительно до ``10 000 000`` лиц. Если FindFace Enterprise Server SDK развертывается на одном сервере, одного шарда, созданного по умолчанию, будет достаточно. При развертывании в кластерной среде количество шардов рассчитывается в зависимости от нескольких параметров (см. ниже).

source: Install tntapi standalone
ru: Установка tntapi на одном сервере

source: Install and configure the ``tntapi`` component as follows:
ru: Установите и настройте компонент ``tntapi`` следующим образом:

source: Install ``tntapi``. Tarantool will be installed automatically along with it.
ru: Установите компонент ``tntapi``. База данных Tarantool будет установлена автоматически вместе с ним.

source: Disable the Tarantool example service autostart and stop the service.
ru: Удалите тестовый сервис Tarantool из автозагрузки Ubuntu и остановите его.

source: For a small-scale project, the ``tntapi`` shard created by default (``tarantool@FindFace``) would suffice as 1 shard can handle up to 10,000,000 faces. Configuration settings of the default shard are defined in the file ``/etc/tarantool/instances.enabled/FindFace.lua``. We strongly recommend you not to add or edit anything in this file, except the maximum memory usage (``memtx_memory``), the NTLS IP address required for the ``tntapi`` licensing, and the remote access setting. The maximum memory usage should be set in bytes, depending on the number of faces the shard handles, at the rate roughly 1280 byte per face.
ru: Поскольку один шард может обрабатывать до ``10 000 000`` лиц, для обслуживания небольших проектов до ``1 000 000`` лиц будет достаточно задействовать шард ``tntapi``, созданный по умолчанию (``tarantool@FindFace``). Настройки конфигурации данного шарда задаются в файле ``/etc/tarantool/instances.enabled/FindFace.lua``. Настоятельно рекомендуется ничего не добавлять и не редактировать в данном файле, за исключением максимального использования оперативной памяти (``memtx_memory``), IP-адреса локального сервера лицензий NTLS, необходимого для лицензирования ``tntapi``, а также настроек удаленного доступа. Максимальное использование памяти задается в байтах в зависимости от количества лиц, обрабатываемых шардом, исходя из соотношения примерно 1280 байт на 1 лицо.

source: Open the configuration file::
ru: Откройте файл конфигурации::

source: Edit the value due to the number of faces the shard handles. The value ``1.2*1024*1024*1024`` corresponds to 1,000,000 faces::
ru: Отредактируйте значение в зависимости от количества лиц, обрабатываемых шардом. Значение ``1.2*1024*1024*1024`` соответствует ``1 000 000`` лиц::

source: Specify the NTLS IP address if NTLS is remote::
ru: Укажите IP-адрес сервера NTLS, если он удаленный::

source: With standalone deployment, you can access Tarantool by default only locally (``127.0.0.1``). If you want to access Tarantool from a remote host, either specify the remote host IP address in the ``FindFace.start`` section, or change ``127.0.0.1`` to ``0.0.0.0`` there to allow access to Tarantool from any IP address. In the case-study below, you allow access only from ``192.168.113.10``::
ru: Если Сервер FindFace развертывается на одиночном физическом сервере, база данных Tarantool по умолчанию будет доступна только локально (``127.0.0.1``). Если необходимо открыть доступ к базе данных Tarantool с удаленного сервера, в разделе ``FindFace.start`` укажите IP-адрес определенного сервера, либо измените ``127.0.0.1`` на ``0.0.0.0``, чтобы разрешить доступ к базе данных Tarantool со всех IP-адресов. В примере ниже доступ возможен только с IP-адреса ``192.168.113.10``::

source: Now you allow access from any IP address::
ru: Здесь доступ возможен с любого IP-адреса::

source: Configure the ``tntapi`` shard to autostart and start the shard.
ru: Добавьте шард ``tntapi`` в автозагрузку Ubuntu и запустите шард.

source: Retrieve the shard status. The command will return a service description, a status (should be Active), path and running time.
ru: Убедитесь, что шард активен. Команда вернет описание сервиса, его статус (должен быть Активен), путь и длительность текущей сессии.

source: You can view the ``tntapi`` :ref:`logs <logs>` by executing:
ru: Для того чтобы отобразить :ref:`логи <logs>` ``tntapi``, выполните команду:

source: The ``tntapi.json`` file containing the tntapi shard parameters is automatically installed along with ``tntapi`` into the ``/etc/`` folder.
ru: Файл ``tntapi.json`` с описанием параметров шарда автоматически устанавливается вместе с компонентом ``tntapi`` в папку ``/etc``.

source: You will have to uncomment the path to ``tntapi.json`` when :ref:`configuring network <configure-network>`.
ru: Вам потребуется раскомментировать путь к данному файлу в :ref:`настройках сети <configure-network>`.

source: Install tntapi cluster
ru: Установка tntapi на кластере серверов

source: Install ``tntapi`` on designated hosts. Tarantool will be installed automatically along it.
ru: Установите компонент ``tntapi`` на выделенных серверах. База данных Tarantool будет установлена автоматически вместе с ним.

source: Create ``tntapi`` shards on each ``tntapi`` host. To learn how to shard, let's consider a case-study of a cluster environment containing 4 database hosts. We'll create 4 shards on each.
ru: Создайте шарды ``tntapi`` на каждом сервере. Процедура шардинга будет рассмотрена на примере кластерной среды, содержащей 4 сервера под базу данных, на каждом из которых нужно создать по 4 шарда.

source: When creating shards in large installations, observe the following rules:
ru: При создании шардов для крупных проектов соблюдайте следующие правила:

source: 1 ``tntapi`` shard can handle approximately 10,000,000 faces.
ru: Один шард может обрабатывать приблизительно ``10 000 000`` лиц.

source: The number of shards on a single host should not exceed the number of its physical processor cores minus 1.
ru: Количество шардов на одном сервере не должно превышать число физических ядер процессора минус 1.

source: Disable the Tarantool example service autostart and stop the service. Do so for all the 4 hosts.
ru: Удалите тестовый сервис Tarantool из автозагрузки Ubuntu и остановите его.

source: Disable the shard created by default. Do so for all the 4 hosts.
ru: На каждом из 4-х серверов отключите созданный по умолчанию шард.

source: Write a bash script ``shard.sh`` that will automatically create configuration files for all shards on a particular host. Do so for the 4 hosts. Use the following script as a base for your own code. The exemplary script creates 4 shards listening to the ports: tntapi ``33001..33004`` and http ``8001..8004``.
ru: Напишите bash-скрипт ``shard.sh``, который автоматически создаст шарды и файлы конфигурации для каждого из них. Скрипт должен быть написан для каждого из 4-х серверов. Используйте приведенный ниже скрипт как основу для своего кода. Данный скрипт создает на сервере 4 шарда, использующие порты: tntapi ``33001..33004`` и http ``8001..8004``.

source: The script below creates configuration files based on the default configuration settings stored in the file ``/etc/tarantool/instances.enabled/FindFace.lua``. We strongly recommend you not to add or edit anything in the default file, except the maximum memory usage (``memtx_memory``) and the NTLS IP address required for the ``tntapi`` licensing. The maximum memory usage should be set in bytes for each shard, depending on the number of faces a shard handles, at the rate roughly 1280 byte per face.
ru: Скрипт создает файлы конфигурации на основе настроек по умолчанию, хранящихся в файле ``/etc/tarantool/instances.enabled/FindFace.lua``. Настоятельно рекомендуется ничего не добавлять и не редактировать в этом файле, за исключением максимального использования оперативной памяти (``memtx_memory``) и IP-адреса локального сервера лицензий NTLS, необходимого для лицензирования ``tntapi``. Максимальное использование памяти задается для каждого шарда в байтах в зависимости от количества лиц, обрабатываемых шардом, исходя из соотношения примерно 1280 байт на 1 лицо.

source: Edit the value due the number of faces a shard handles. The value ``1.2*1024*1024*1024`` corresponds to 1,000,000 faces::
ru: Отредактируйте значение в зависимости от количества лиц, обрабатываемых шардом. Значение ``1.2*1024*1024*1024`` соответствует ``1 000 000`` лиц::

source: Download the :download:`exemplary script <_scripts/shard.sh>`.
ru: Загрузите :download:`пример скрипта <_scripts/shard.sh>`.

source: Run the script from the home directory.
ru: Запустите скрипт из домашней директории.

source: Check the configuration files created.
ru: Проверьте, созданы ли файлы конфигурации.

source: Launch all the 4 shards. Do so on each host.
ru: Запустите все 4 шарда. Это нужно сделать на каждом сервере.

source: Retrieve the shards status.
ru: Проверьте статус шардов.

source: You should get the following output::
ru: Вы должны получить следующие сообщения::

source: On the ``findface-facenapi`` host, create a file ``tntapi_cluster.json`` containing the addresses and ports of all the shards. Distribute available shards evenly over ~1024 cells in one line. Click `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/tntapi_cluster.json>`__ to see the file for 4 hosts with 4 shards on each.
ru: На сервере с компонентом ``findface-facenapi`` создайте файл ``tntapi_cluster.json``, содержащий адреса и порты всех шардов. Распределите доступные шарды равномерно по 1024 ячейкам в одной строке. Нажмите `здесь <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/tntapi_cluster.json>`__, чтобы посмотреть, как выглядит файл для 4 серверов с 4 шардами на каждом.

source: You can create ``tntapi_cluster.json`` as follows:
ru: Вы можете создать файл ``tntapi_cluster.json`` следующим образом:

source: Create a file that lists all the shards, each shard with a new line (click `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/s.txt>`__ to view the example).
ru: Создайте файл с линейным списком всех шардов, каждый шард с новой строки (нажмите `здесь <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/s.txt>`__, чтобы посмотреть пример).

source: Run the script below (click `here <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/creating_tntapi_cluster.json_script.md>`__ to view the script). As a result, a new file ``tntapi_cluster.json`` will be created and contain a list of all shards distributed evenly over 1024 cells.
ru: Выполните приведенный ниже `скрипт <https://raw.githubusercontent.com/NTech-Lab/FFSER-file-examples/master/creating_tntapi_cluster.json_script.md>`__. В результате будет создан новый файл ``tntapi_cluster.json``, содержащий список адресов и портов всех шардов, равномерно распределенных по 1024 ячейкам.

source: Move ``tntapi_cluster.json`` to the directory ``/etc/``.
ru: Переместите файл ``tntapi_cluster.json`` в папку ``/etc``.

source: You will have to uncomment and specify the path to ``tntapi_cluster.json`` when :ref:`configuring network <configure-network>`.
ru: Вам потребуется раскомментировать путь к данному файлу в :ref:`настройках сети <configure-network>`.
